{
  "header": {
    "name": "lachlan kermode",
    "profession": "AR/VR engineer"
  },
  "details": {
    "website": "www.lachlankermode.com",
    "github": "github.com/breezykermo",
    "twitter": "twitter.com/lachlankermode",
    "email": "lachiekermode@gmail.com"
  },
  "skills": {
    "programming": [
      "Full stack web development [Node, React, Redux]",
      "Machine and Deep Learning [Tensorflow, PyTorch, Scikit]",
      "General Systems Development [Linux, Golang, Docker, C]"
    ],
    "visual": [
      "3D animation and modeling [Maya, Blender]",
      "Virtual and Augmented Reality [Unreal, Unity]",
      "Film editing and compositing [Premiere, After Effects]"
    ],
    "audio": [
      "Composer/lyricist [stage, studio]",
      "Music director [stage]",
      "Voice [10+ yrs]",
      "Guitar [10+ yrs]",
      "Piano [4 yrs]"
    ]
  },
  "sections": [
    {
      "title": "statement",
      "content": "Lachlan Kermode is an audiovisual engineer who specializes in systems development, machine learning, and augmented media systems. He is currently software lead at London-based research agency Forensic Architecture, where he develops research tools and workflows to enhance human rights research using multi-media systems. He has a degree in Computer Science from Princeton University, and has worked across industry, research, and artistic contexts."
    },
    {
      "title": "experience",
      "pills": [
        {
          "left": "July 2018 - now",
          "body": {
            "title": "Forensic Architecture",
            "link": "https://forensic-architecture.org",
            "content": "I direct engineering for full stack platforms, 3-D data pipelines, and machine learning workflows. I also sit on our data management committee for digital security, and offer expertise across investigations that are computer oriented. See forensic-architecture.org for more information."
          },
          "right": "London, United Kingdom"
        },
        {
          "left": "2016-2018",
          "body": {
            "title": "Full Stack Systems Engineer",
            "link": "https://resume.lachlankermode.com",
            "content": "I worked across several technical contexts in industry, from developing mobile applications in Swift and Objective C, to building full stack applications from scratch in Node, React, and React Native, to infrastructure and backend optimization in Docker, Ansible, Python, Golang and various other languages."
          }
        },
        {
          "left": "2014-2019",
          "body": {
            "title": "Triangle Club Writers Workshop",
            "link": "http://www.triangleshow.com/",
            "content": "Wrote and produced three full-length musical comedies as part of a 12-person creative workshop. Primarily responsible for music and lyrics, I wrote upwards of 15 songs that were produced as part of the annual Princeton Triangle show."
          }
        }
      ]
    },
    {
      "title": "projects + exhibitions",
      "pills": [
        {
          "left": "May-July 2019",
          "body": {
            "title": "Triple Chaser: Whitney Museum",
            "link": "https://forensic-architecture.org/investigation/triple-chaser",
            "content": "In collaboration with Laura Poitras/Praxis Films, I trained computer vision machine learning classifiers to detect Safariland tear gas canisteres among the millions of images shared online, using an innovative technique of training using synthetic data rendered from photorealistic 3-D scenes."
          },
          "right": "New York, USA"
        },
        {
          "left": "March 2018",
          "body": {
            "title": "Through the Internet: 3-D Animated Short",
            "content": "A 3-minute animated short depicted the journey of a data packet from a cellphone in Madrid to a Facebook data center in New Jersey. TTI is a project of 'animated documentary', an ongoing set of projects that looks to think algorithmic metaphor through its spatial consistency by visualising algorithms in 3-D animation."
          },
          "right": "Princeton, USA"
        },
        {
          "left": "June-August 2016",
          "body": {
            "title": "Paideia Creative Residency",
            "content": "I helped to workshop and write a full-length musical based on the Euripides drama \"'Ἑλένη\", which was later produced into a cast EP by broadway actors."
          },
          "right": "Selianitika, Greece"
        }
      ]
    }
  ]
}
